class Constants:
    URL = 'https://qa-scooter.praktikum-services.ru/'
    URL_ORDER = 'https://qa-scooter.praktikum-services.ru/order'
    URL_DZEN = 'https://dzen.ru/'
    ORDER_CONFIRMATION_TEXT = 'Заказ оформлен'

class ResponseText:

    PAY_RESPONSE_TEXT = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'

    QUANTITY_RESPONSE_TEXT = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'

    RENT_RESPONSE_TEXT = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'

    ORDER_RESPONSE_TEXT = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'

    EXTEND_AND_RETURN_RESPONSE_TEXT = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'

    CHARGER_RESPONSE_TEXT = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'

    CANCEL_ORDER_RESPONSE_TEXT = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'

    DELIVERY_RESPONSE_TEXT = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'





